import type { Template } from './types';

export const templates: Template[] = [
  {
    id: 1,
    title: '🎓 Изучите основы API с помощью интерактивного практического учебного курса',
    description:
      'Если вы хотите, чтобы ваши отправленные анкеты Typeform сохранялись в таблице Google, этот шаблон для вас. Этот шаблон поможет вам сделать именно это, а также использовать OpenAI для описания отправленной анкеты и отправки электронного письма с этим описанием.',
    icons: [],
  },
  {
    id: 2,
    title: '🎓 Изучите основы API с помощью интерактивного практического учебного курса',
    description:
      'Если вы хотите, чтобы ваши отправленные анкеты Typeform сохранялись в таблице Google, этот шаблон для вас. Этот шаблон поможет вам сделать именно это, а также использовать OpenAI для описания отправленной анкеты и отправки электронного письма с этим описанием.',
    icons: [],
  },
  {
    id: 3,
    title: '🎓 Изучите основы API с помощью интерактивного практического учебного курса',
    description:
      'Если вы хотите, чтобы ваши отправленные анкеты Typeform сохранялись в таблице Google, этот шаблон для вас. Этот шаблон поможет вам сделать именно это, а также использовать OpenAI для описания отправленной анкеты и отправки электронного письма с этим описанием.',
    icons: [],
  },
  {
    id: 4,
    title: '🎓 Изучите основы API с помощью интерактивного практического учебного курса',
    description:
      'Если вы хотите, чтобы ваши отправленные анкеты Typeform сохранялись в таблице Google, этот шаблон для вас. Этот шаблон поможет вам сделать именно это, а также использовать OpenAI для описания отправленной анкеты и отправки электронного письма с этим описанием.',
    icons: [],
  },
  {
    id: 5,
    title: '🎓 Изучите основы API с помощью интерактивного практического учебного курса',
    description:
      'Если вы хотите, чтобы ваши отправленные анкеты Typeform сохранялись в таблице Google, этот шаблон для вас. Этот шаблон поможет вам сделать именно это, а также использовать OpenAI для описания отправленной анкеты и отправки электронного письма с этим описанием.',
    icons: [],
  },
  {
    id: 6,
    title: '🎓 Изучите основы API с помощью интерактивного практического учебного курса',
    description:
      'Если вы хотите, чтобы ваши отправленные анкеты Typeform сохранялись в таблице Google, этот шаблон для вас. Этот шаблон поможет вам сделать именно это, а также использовать OpenAI для описания отправленной анкеты и отправки электронного письма с этим описанием.',
    icons: [],
  },
  {
    id: 7,
    title: '🎓 Изучите основы API с помощью интерактивного практического учебного курса',
    description:
      'Если вы хотите, чтобы ваши отправленные анкеты Typeform сохранялись в таблице Google, этот шаблон для вас. Этот шаблон поможет вам сделать именно это, а также использовать OpenAI для описания отправленной анкеты и отправки электронного письма с этим описанием.',
    icons: [],
  },
  {
    id: 8,
    title: '🎓 Изучите основы API с помощью интерактивного практического учебного курса',
    description:
      'Если вы хотите, чтобы ваши отправленные анкеты Typeform сохранялись в таблице Google, этот шаблон для вас. Этот шаблон поможет вам сделать именно это, а также использовать OpenAI для описания отправленной анкеты и отправки электронного письма с этим описанием.',
    icons: [],
  },
  {
    id: 9,
    title: '🎓 Изучите основы API с помощью интерактивного практического учебного курса',
    description:
      'Если вы хотите, чтобы ваши отправленные анкеты Typeform сохранялись в таблице Google, этот шаблон для вас. Этот шаблон поможет вам сделать именно это, а также использовать OpenAI для описания отправленной анкеты и отправки электронного письма с этим описанием.',
    icons: [],
  },
  {
    id: 10,
    title: '🎓 Изучите основы API с помощью интерактивного практического учебного курса',
    description:
      'Если вы хотите, чтобы ваши отправленные анкеты Typeform сохранялись в таблице Google, этот шаблон для вас. Этот шаблон поможет вам сделать именно это, а также использовать OpenAI для описания отправленной анкеты и отправки электронного письма с этим описанием.',
    icons: [],
  },
];

export const categoryOptions = [
  { value: 'api', label: 'API' },
  { value: 'automation', label: 'Автоматизация' },
  { value: 'integration', label: 'Интеграция' },
  { value: 'workflow', label: 'Рабочий процесс' },
];

